[
  {
    "id": "nlp_alignment",
    "title": "Alignment & Personalization",
    "group": "nlp",
    "description": "RLHF, preference modeling, pluralistic alignment; techniques to align large models with human values, individual preferences, and cultural norms."
  },
  {
    "id": "nlp_cognitive",
    "title": "Cognitive & Human-Inspired Signals",
    "group": "nlp",
    "description": "Eye-tracking, reading times, brain alignment, narrative comprehension; grounding NLP models in cognitive data and human processing patterns."
  },
  {
    "id": "nlp_multilingual",
    "title": "Multilingual & Low-Resource NLP",
    "group": "nlp",
    "description": "Cross-lingual transfer, zero-shot learning, data augmentation, synthetic corpora; addressing linguistic diversity and under-resourced languages."
  },
  {
    "id": "nlp_multimodal",
    "title": "Multimodal NLP",
    "group": "nlp",
    "description": "Language + vision, audio, and video; unified embeddings, modality alignment, richer multimodal representations for reasoning and generation."
  },
  {
    "id": "cv_3d_and_neural_rendering",
    "title": "3D & Neural Rendering",
    "group": "cv",

    "description": "Multi-view reconstruction, neural radiance fields (NeRFs), Gaussian splatting, differentiable imaging, computational imaging pipelines"
  },
  {
    "id": "cv_image_video_synthesis",
    "title": "Image & Video Synthesis",

    "group": "cv",
    "description": "Diffusion / GAN models, controllable generation, temporal consistency, video generation, domain transfer"
  },
  {
    "id": "cv_multimodal_and_vision_language",
    "title": "Multimodal & Vision-Language",
    "group": "cv",
    "description": "Vision + text / audio, visual reasoning, grounding, embodied perception, vision-language action models"
  },
  {
    "id": "robotics_rlhf",
    "title": "AI on Robotics (RLHF)",
    "group": "robotics",
    "description": "Reinforcement learning from human feedback applied to robotic systems; learning policies, manipulation tasks, and embodied agents through human preferences"
  },
  {
    "id": "simulation_terrain",
    "title": "Terrain Simulation",
    "group": "simulation",
    "description": "Physics-based terrain generation, procedural landscapes, erosion models, real-time deformation, and realistic environment synthesis"
  },
  {
    "id": "crypto_post_quantum",
    "title": "Post-Quantum Cryptography",
    "group": "math",
    "description": "Lattice-based, code-based, and hash-based cryptographic schemes resistant to quantum attacks; mathematical foundations for quantum-safe security"
  },
  {
    "id": "systems_multi_agent",
    "title": "Multi-Agent Systems",
    "group": "systems",
    "description": "Coordination, emergent behavior, swarm intelligence, distributed decision-making; systems where multiple autonomous agents interact and cooperate"
  },
  {
    "id": "ml_graph_networks",
    "title": "Graph Neural Networks",
    "group": "graph",
    "description": "Learning on graph-structured data, relational reasoning, message passing, graph transformers; applications in knowledge graphs and multi-context systems"
  }
]
